RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/inc/ht32f65xxx_66xxx_adc.h
/*********************************************************************************************************//**
 * @file    ht32f65xxx_66xxx_adc.h
 * @version $Rev:: 8260         $
 * @date    $Date:: 2024-11-05 #$
 * @brief   The header file of the ADC library.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------------------------------------*/
#ifndef __HT32F65XXX_66XXX_ADC_H
#define __HT32F65XXX_66XXX_ADC_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32.h"

/** @addtogroup HT32F5xxxx_Peripheral_Driver HT32F5xxxx Peripheral Driver
  * @{
  */

/** @addtogroup ADC
  * @{
  */


/* Exported constants --------------------------------------------------------------------------------------*/
/** @defgroup ADC_Exported_Constants ADC exported constants
  * @{
  */
#if (LIBCFG_ADC1)  
#define IS_ADC(x)                               ((x == HT_ADC0) || (x == HT_ADC1))
#else
#define IS_ADC(x)                               (x == HT_ADC0)
#endif

#define ONE_SHOT_MODE                           (0x00000000)
#define CONTINUOUS_MODE                         (0x00000002)
#define DISCONTINUOUS_MODE                      (0x00000003)

#define IS_ADC_CONVERSION_MODE(REGULAR_MODE)    (((REGULAR_MODE) == ONE_SHOT_MODE)   || \
                                                 ((REGULAR_MODE) == CONTINUOUS_MODE) || \
                                                 ((REGULAR_MODE) == DISCONTINUOUS_MODE))

#define IS_ADC_HP_CONVERSION_MODE(HP_MODE)      (((HP_MODE) == ONE_SHOT_MODE)   || \
                                                 ((HP_MODE) == CONTINUOUS_MODE) || \
                                                 ((HP_MODE) == DISCONTINUOUS_MODE))

#if (LIBCFG_ADC1)
#define DUAL_INDEPENDENT                        (0x00000000)
#define DUAL_CASCADE_REGULAR                    (0x00000001)
#define DUAL_CASCADE_REGULAR_H_PRIORITY         (0x00000003)

#define IS_ADC_DUAL_MODE(DUAL_MODE)             (((DUAL_MODE) == DUAL_INDEPENDENT)   || \
                                                 ((DUAL_MODE) == DUAL_CASCADE_REGULAR) || \
                                                 ((DUAL_MODE) == DUAL_CASCADE_REGULAR_H_PRIORITY))
#endif

#if (LIBCFG_ADC_CH_65232)
#define ADC_CH_0                                (0)
#define ADC_CH_1                                (1)
#define ADC_CH_2                                (2)
#define ADC_CH_3                                (3)
#define ADC_CH_4                                (4)
#define ADC_CH_5                                (5)
#define ADC_CH_6                                (6)
#define ADC_CH_7                                (7)
#define ADC_CH_8                                (8)
#define ADC_CH_9                                (9)
#define ADC_CH_10                               (10)
#define ADC_CH_11                               (11)
#define ADC_CH_OPA0                             (12)
#define ADC_CH_GND_VREF                         (13)
#define ADC_CH_VDD_VREF                         (14)

#define IS_ADC_CHANNEL(CHANNEL)                 (((CHANNEL) == ADC_CH_0) || ((CHANNEL) == ADC_CH_1) || \
                                                 ((CHANNEL) == ADC_CH_2) || ((CHANNEL) == ADC_CH_3) || \
                                                 ((CHANNEL) == ADC_CH_4) || ((CHANNEL) == ADC_CH_5) || \
                                                 ((CHANNEL) == ADC_CH_6) || ((CHANNEL) == ADC_CH_7) || \
                                                 ((CHANNEL) == ADC_CH_8) || ((CHANNEL) == ADC_CH_9) || \
                                                 ((CHANNEL) == ADC_CH_10) || ((CHANNEL) == ADC_CH_11) || \
                                                 ((CHANNEL) == ADC_CH_OPA0) || \
                                                 ((CHANNEL) == ADC_CH_GND_VREF) || ((CHANNEL) == ADC_CH_VDD_VREF))

#define IS_ADC_INPUT_CHANNEL(CHANNEL)           (((CHANNEL) == ADC_CH_0) || ((CHANNEL) == ADC_CH_1) || \
                                                 ((CHANNEL) == ADC_CH_2) || ((CHANNEL) == ADC_CH_3) || \
                                                 ((CHANNEL) == ADC_CH_4) || ((CHANNEL) == ADC_CH_5) || \
                                                 ((CHANNEL) == ADC_CH_6) || ((CHANNEL) == ADC_CH_7) || \
                                                 ((CHANNEL) == ADC_CH_OPA0))
#elif (LIBCFG_ADC_CH_66XXX_V1)
#define ADC_CH_0                                (0)
#define ADC_CH_1                                (1)
#define ADC_CH_2                                (2)
#define ADC_CH_3                                (3)
#define ADC_CH_4                                (4)
#define ADC_CH_5                                (5)
#define ADC_CH_6                                (6)
#define ADC_CH_7                                (7)
#define ADC_CH_8                                (8)
#define ADC_CH_9                                (9)
#define ADC_CH_10                               (10)
#define ADC_CH_11                               (11)
#define ADC_CH_PGA0O                            (12)
#define ADC_CH_PGA1O                            (13)
#define ADC_CH_PGA2O                            (14)
#define ADC_CH_PGA3O                            (15)
#define ADC_CH_BANDGAP                          (16)
#define ADC_CH_MVDDA                            (17)

#define IS_ADC_CHANNEL(CHANNEL)                 (((CHANNEL) == ADC_CH_0) || ((CHANNEL) == ADC_CH_1) || \
                                                 ((CHANNEL) == ADC_CH_2) || ((CHANNEL) == ADC_CH_3) || \
                                                 ((CHANNEL) == ADC_CH_4) || ((CHANNEL) == ADC_CH_5) || \
                                                 ((CHANNEL) == ADC_CH_6) || ((CHANNEL) == ADC_CH_7) || \
                                                 ((CHANNEL) == ADC_CH_8) || ((CHANNEL) == ADC_CH_9) || \
                                                 ((CHANNEL) == ADC_CH_10) || ((CHANNEL) == ADC_CH_11) || \
                                                 ((CHANNEL) == ADC_CH_PGA0O) || ((CHANNEL) == ADC_CH_PGA1O) || \
                                                 ((CHANNEL) == ADC_CH_PGA2O) || ((CHANNEL) == ADC_CH_PGA3O) || \
                                                 ((CHANNEL) == ADC_CH_BANDGAP) || ((CHANNEL) == ADC_CH_MVDDA))

#define IS_ADC_INPUT_CHANNEL(CHANNEL)           (((CHANNEL) == ADC_CH_0) || ((CHANNEL) == ADC_CH_1) || \
                                                 ((CHANNEL) == ADC_CH_2) || ((CHANNEL) == ADC_CH_3) || \
                                                 ((CHANNEL) == ADC_CH_4) || ((CHANNEL) == ADC_CH_5) || \
                                                 ((CHANNEL) == ADC_CH_6) || ((CHANNEL) == ADC_CH_7) || \
                                                 ((CHANNEL) == ADC_CH_8) || ((CHANNEL) == ADC_CH_9) || \
                                                 ((CHANNEL) == ADC_CH_10) || ((CHANNEL) == ADC_CH_11) || \
                                                 ((CHANNEL) == ADC_CH_PGA0O) || ((CHANNEL) == ADC_CH_PGA1O) || \
                                                 ((CHANNEL) == ADC_CH_PGA2O) || ((CHANNEL) == ADC_CH_PGA3O))
#else
#define ADC_CH_0                                (0)
#define ADC_CH_1                                (1)
#define ADC_CH_2                                (2)
#define ADC_CH_3                                (3)
#define ADC_CH_4                                (4)
#define ADC_CH_5                                (5)
#define ADC_CH_6                                (6)
#define ADC_CH_7                                (7)
#define ADC_CH_OPA0                             (8)
#define ADC_CH_OPA1                             (9)
#define ADC_CH_GND_VREF                         (12)
#define ADC_CH_VDD_VREF                         (13)

#define IS_ADC_CHANNEL(CHANNEL)                 (((CHANNEL) == ADC_CH_0) || ((CHANNEL) == ADC_CH_1) || \
                                                 ((CHANNEL) == ADC_CH_2) || ((CHANNEL) == ADC_CH_3) || \
                                                 ((CHANNEL) == ADC_CH_4) || ((CHANNEL) == ADC_CH_5) || \
                                                 ((CHANNEL) == ADC_CH_6) || ((CHANNEL) == ADC_CH_7) || \
                                                 ((CHANNEL) == ADC_CH_OPA0) || ((CHANNEL) == ADC_CH_OPA1) || \
                                                 ((CHANNEL) == ADC_CH_GND_VREF) || ((CHANNEL) == ADC_CH_VDD_VREF))

#define IS_ADC_INPUT_CHANNEL(CHANNEL)           (((CHANNEL) == ADC_CH_0) || ((CHANNEL) == ADC_CH_1) || \
                                                 ((CHANNEL) == ADC_CH_2) || ((CHANNEL) == ADC_CH_3) || \
                                                 ((CHANNEL) == ADC_CH_4) || ((CHANNEL) == ADC_CH_5) || \
                                                 ((CHANNEL) == ADC_CH_6) || ((CHANNEL) == ADC_CH_7) || \
                                                 ((CHANNEL) == ADC_CH_OPA0) || ((CHANNEL) == ADC_CH_OPA1))
#endif


#define ADC_TRIG_SOFTWARE                       (1UL << 0)

#define ADC_TRIG_MCTM0_MTO                      ((1UL << 2) | (0UL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CH0O                     ((1UL << 2) | (1UL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CH1O                     ((1UL << 2) | (2UL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CH2O                     ((1UL << 2) | (3UL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CH3O                     ((1UL << 2) | (4UL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CH0MEV                   ((1UL << 2) | (0x18UL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CH0DEV                   ((1UL << 2) | (0x28UL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CH0MDEV                  ((1UL << 2) | (0x38UL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CH1MEV                   ((1UL << 2) | (0x19UL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CH1DEV                   ((1UL << 2) | (0x29UL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CH1MDEV                  ((1UL << 2) | (0x39UL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CH2MEV                   ((1UL << 2) | (0x1AUL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CH2DEV                   ((1UL << 2) | (0x2AUL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CH2MDEV                  ((1UL << 2) | (0x3AUL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CH3MEV                   ((1UL << 2) | (0x1BUL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CH3DEV                   ((1UL << 2) | (0x2BUL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CH3MDEV                  ((1UL << 2) | (0x3BUL << 24) | (0UL << 16))

#define IS_ADC_TRIG_MCTM0_CHALL(REGTRIG)        (0)

#if (LIBCFG_ADC_TRIG_SRC_V2)
#define ADC_TRIG_MCTM0_CHALLMEV                 ((1UL << 2) | (0x1CUL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CHALLDEV                 ((1UL << 2) | (0x2CUL << 24) | (0UL << 16))
#define ADC_TRIG_MCTM0_CHALLMDEV                ((1UL << 2) | (0x3CUL << 24) | (0UL << 16))

#undef  IS_ADC_TRIG_MCTM0_CHALL
#define IS_ADC_TRIG_MCTM0_CHALL(REGTRIG)        ((REGTRIG == ADC_TRIG_MCTM0_CHALLMEV) || \
                                                 (REGTRIG == ADC_TRIG_MCTM0_CHALLDEV) || \
                                                 (REGTRIG == ADC_TRIG_MCTM0_CHALLMDEV))
#endif

#define ADC_TRIG_CMP0                           ((1UL << 4) | (0UL << 20))
#define ADC_TRIG_CMP1                           ((1UL << 4) | (1UL << 20))
#if (LIBCFG_CMP2)
#define ADC_TRIG_CMP2                           ((1UL << 4) | (2UL << 20))

#define IS_ADC_TRIG_CMP2(REGTRIG)               ((REGTRIG == ADC_TRIG_CMP2))
#else
#define IS_ADC_TRIG_CMP2(REGTRIG)               (0)
#endif

#define ADC_TRIG_BFTM0                          ((1UL << 3) | (0UL << 22) | (0UL << 19))
#define ADC_TRIG_BFTM1                          ((1UL << 3) | (0UL << 22) | (1UL << 19))

#define ADC_TRIG_GPTM0_MTO                      ((1UL << 2) | (0UL << 24) | (1UL << 16))
#define ADC_TRIG_GPTM0_CH0O                     ((1UL << 2) | (1UL << 24) | (1UL << 16))
#define ADC_TRIG_GPTM0_CH1O                     ((1UL << 2) | (2UL << 24) | (1UL << 16))
#define ADC_TRIG_GPTM0_CH2O                     ((1UL << 2) | (3UL << 24) | (1UL << 16))
#define ADC_TRIG_GPTM0_CH3O                     ((1UL << 2) | (4UL << 24) | (1UL << 16))

#define ADC_TRIG_EXTI_0                         ((1UL << 1) | ( 0UL << 8))
#define ADC_TRIG_EXTI_1                         ((1UL << 1) | ( 1UL << 8))
#define ADC_TRIG_EXTI_2                         ((1UL << 1) | ( 2UL << 8))
#define ADC_TRIG_EXTI_3                         ((1UL << 1) | ( 3UL << 8))
#define ADC_TRIG_EXTI_4                         ((1UL << 1) | ( 4UL << 8))
#define ADC_TRIG_EXTI_5                         ((1UL << 1) | ( 5UL << 8))
#define ADC_TRIG_EXTI_6                         ((1UL << 1) | ( 6UL << 8))
#define ADC_TRIG_EXTI_7                         ((1UL << 1) | ( 7UL << 8))
#define ADC_TRIG_EXTI_8                         ((1UL << 1) | ( 8UL << 8))
#define ADC_TRIG_EXTI_9                         ((1UL << 1) | ( 9UL << 8))
#define ADC_TRIG_EXTI_10                        ((1UL << 1) | (10UL << 8))
#define ADC_TRIG_EXTI_11                        ((1UL << 1) | (11UL << 8))
#define ADC_TRIG_EXTI_12                        ((1UL << 1) | (12UL << 8))
#define ADC_TRIG_EXTI_13                        ((1UL << 1) | (13UL << 8))
#define ADC_TRIG_EXTI_14                        ((1UL << 1) | (14UL << 8))
#define ADC_TRIG_EXTI_15                        ((1UL << 1) | (15UL << 8))

#define IS_ADC_TRIG(REGTRIG)                    (((REGTRIG) == ADC_TRIG_GPTM0_MTO)     || \
                                                 ((REGTRIG) == ADC_TRIG_GPTM0_CH0O)    || \
                                                 ((REGTRIG) == ADC_TRIG_GPTM0_CH1O)    || \
                                                 ((REGTRIG) == ADC_TRIG_GPTM0_CH2O)    || \
                                                 ((REGTRIG) == ADC_TRIG_GPTM0_CH3O)    || \
                                                 ((REGTRIG) == ADC_TRIG_MCTM0_MTO)     || \
                                                 ((REGTRIG) == ADC_TRIG_MCTM0_CH0O)    || \
                                                 ((REGTRIG) == ADC_TRIG_MCTM0_CH1O)    || \
                                                 ((REGTRIG) == ADC_TRIG_MCTM0_CH2O)    || \
                                                 ((REGTRIG) == ADC_TRIG_MCTM0_CH3O)    || \
                                                 ((REGTRIG) == ADC_TRIG_MCTM0_CH0MEV)  || \
                                                 ((REGTRIG) == ADC_TRIG_MCTM0_CH0DEV)  || \
                                                 ((REGTRIG) == ADC_TRIG_MCTM0_CH0MDEV) || \
                                                 ((REGTRIG) == ADC_TRIG_MCTM0_CH1MEV)  || \
                                                 ((REGTRIG) == ADC_TRIG_MCTM0_CH1DEV)  || \
                                                 ((REGTRIG) == ADC_TRIG_MCTM0_CH1MDEV) || \
                                                 ((REGTRIG) == ADC_TRIG_MCTM0_CH2MEV)  || \
                                                 ((REGTRIG) == ADC_TRIG_MCTM0_CH2DEV)  || \
                                                 ((REGTRIG) == ADC_TRIG_MCTM0_CH2MDEV) || \
                                                 ((REGTRIG) == ADC_TRIG_MCTM0_CH3MEV)  || \
                                                 ((REGTRIG) == ADC_TRIG_MCTM0_CH3DEV)  || \
                                                 ((REGTRIG) == ADC_TRIG_MCTM0_CH3MDEV) || \
                                                 (IS_ADC_TRIG_MCTM0_CHALL(REGTRIG))    || \
                                                 ((REGTRIG) == ADC_TRIG_BFTM0)         || \
                                                 ((REGTRIG) == ADC_TRIG_BFTM1)         || \
                                                 ((REGTRIG) == ADC_TRIG_CMP0)          || \
                                                 ((REGTRIG) == ADC_TRIG_CMP1)          || \
                                                 (IS_ADC_TRIG_CMP2(REGTRIG))           || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_0)        || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_1)        || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_2)        || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_3)        || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_4)        || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_5)        || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_6)        || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_7)        || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_8)        || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_9)        || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_10)       || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_11)       || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_12)       || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_13)       || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_14)       || \
                                                 ((REGTRIG) == ADC_TRIG_EXTI_15)       || \
                                                 ((REGTRIG) == ADC_TRIG_SOFTWARE))


